app/Controllers/Mascotas.php

    public function index()
    {
        $model = new MascotaModel();
        $userId = session()->get('id_usuario');

        $data['mascotas'] = $model->where('id_usuario', $userId)->findAll();
---
SELECT *
FROM `mascota`
WHERE `id_usuario` = '1'

    public function ver($id)
    {
        $model = new MascotaModel();
        $qrModel = new InfoQRModel();
        $userId = session()->get('id_usuario');

        $data['mascota'] = $model->where(['id_mascota' => $id, 'id_usuario' => $userId])->first();
---
SELECT *
FROM `mascota`
WHERE `id_mascota` = '1'
AND `id_usuario` = '1'
 LIMIT 1

    public function carnet($id)
    {
        $model = new MascotaModel();
        $userId = session()->get('id_usuario');

        // Validamos que la mascota exista y pertenezca al usuario logueado
        $mascota = $model->where(['id_mascota' => $id, 'id_usuario' => $userId])->first();
---
SELECT *
FROM `mascota`
WHERE `id_mascota` = '1'
AND `id_usuario` = '1'
 LIMIT 1